{
  "120363401867497287@g.us": [
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí pessoal, tudo bem? \n\nEstava dando uma olhada no conteúdo do curso e me deparei com a parte de Jetpack Compose. Achei muito interessante a ideia de criar interfaces modernas com personalização e gerenciamento de estados. Alguém já começou a explorar mais a fundo essa parte? \n\nLembrando que logo vamos começar com os exercícios práticos, então é importante ter o Android Studio configurado e entender um pouco sobre a estrutura de um projeto Android. \n\nSe alguém tiver alguma dúvida ou precisar de ajuda com a configuração do ambiente, é só chamar!",
      "horario": "2025-06-03T14:27:01.737Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí pessoal, tudo bem? \n\nEstava dando uma olhada no material do curso e me deparei com o projeto final que vamos desenvolver, uma lista de tarefas com Jetpack Compose e Room. Achei bem interessante a ideia de aplicar tudo o que vamos aprender durante o curso em um aplicativo real.\n\nAlguém já começou a se preparar para o projeto final? Tem alguma dúvida sobre como vamos começar a estruturar o aplicativo? \n\nAh, e não esqueçam de dar uma olhada no repositório do Celso no GitHub, tem bastante material disponível para ajudar a gente a estudar. \n\nUm abraço!",
      "horario": "2025-06-03T17:30:02.407Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí galera! Queria compartilhar uma coisa que achei interessante no conteúdo do curso. Vocês sabiam que vamos aprender a trabalhar com Room para persistência de dados? É algo que eu estava ansioso para aprender e parece que vai ser muito útil para nossos projetos. \n\nAlguém já tem alguma experiência com Room ou banco de dados em Android? Queria saber se alguém tem alguma dica ou coisa que possa compartilhar com a gente. \n\nAh, e não esqueçam que nosso projeto final é criar um aplicativo de lista de tarefas, vai ser um desafio, mas com o que estamos aprendendo até agora, eu estou bem confiante que vamos conseguir fazer algo incrível! \n\nTudo bem por aí?",
      "horario": "2025-06-04T13:30:01.930Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí pessoal, tudo bem? Estou dando uma olhada no conteúdo do curso e me deparei com o projeto final que vamos desenvolver. Um aplicativo de lista de tarefas com Jetpack Compose e Room parece ser um desafio interessante! Alguém já começou a pensar em como vai estruturar o banco de dados ou a navegação entre telas? Querendo ou não, o projeto final vai nos dar uma noção geral de tudo o que vimos até agora.",
      "horario": "2025-06-04T14:00:01.687Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "Olá! Hoje é um bom momento para revisar os conteúdos do curso \"Escola de Programadores Mobile\". Em breve enviaremos novidades!",
      "horario": "2025-06-04T17:52:00.893Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí, pessoal! Tudo bem? Estava dando uma olhada no conteúdo do curso e me deparei com o projeto final que vamos desenvolver. Um aplicativo de lista de tarefas com Jetpack Compose, Room e navegação entre telas. Acho que vai ser um desafio e tanto, mas com certeza vamos aprender muito! Alguém já começou a se preparar ou a se organizar para o projeto? Qual é a expectativa de vocês?",
      "horario": "2025-06-04T18:23:01.384Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí, pessoal! Tudo bem? Queria compartilhar uma coisa que achei interessante no material do curso. O professor Celso vai nos ensinar a usar o Room para persistência de dados e o ViewModel com StateFlow. Alguém já teve experiência com algum desses tópicos? Estou ansioso para começar a ver como tudo isso funciona na prática. Lembrem-se de que já temos o projeto final em mente: um aplicativo de lista de tarefas! Quem começou a pensar em como vai estruturar o app?",
      "horario": "2025-06-04T18:24:01.252Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "Galera, beleza? \n\nEstava dando uma olhada no conteúdo do curso e me deparei com a parte de Jetpack Compose. Alguém já teve a chance de explorar mais a fundo a documentação do Compose? Estou com uma dúvida sobre como funciona a gestão de estados em formulários e se alguém puder compartilhar alguma dica ou exemplo, ficarei muito grato! \n\nAlém disso, só um lembrete: a prática de criar um programa para calcular média de notas e verificar aprovação já está valendo, né? Não deixem de fazer! \n\nTudo bem, é isso. Se alguém tiver alguma novidade ou pergunta, manda aí!",
      "horario": "2025-06-04T20:00:01.591Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí, pessoal! Tudo bem? Estava dando uma olhada no conteúdo do curso e me deparei com o projeto final que vamos desenvolver: um aplicativo de lista de tarefas com Jetpack Compose, Room e navegação. Acho que vai ser um desafio e tanto, mas com certeza vamos aprender muito!\n\nAlguém já começou a se preparar ou a se familiarizar com o Android Studio e o IntelliJ IDEA? Estou começando a configurar meu ambiente de desenvolvimento e já estou com algumas dúvidas. Se alguém tiver alguma dica ou conselho, seria de grande ajuda!\n\nVamos trocar ideias e nos ajudar mutuamente nessa jornada de aprendizado!",
      "horario": "2025-06-05T13:27:01.965Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí pessoal, beleza? Queria compartilhar uma coisa que me chamou atenção no conteúdo do curso. O objetivo de desenvolver um aplicativo funcional com Kotlin e Jetpack Compose parece bem desafiador, mas também muito interessante! Estou ansioso para começar a trabalhar no projeto final, que é criar uma lista de tarefas com tudo o que a gente vai aprender. Alguém já começou a se preparar ou a se aprofundar em algum tópico específico?",
      "horario": "2025-06-05T14:23:01.452Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí, pessoal! Tudo bem? Acabei de dar uma olhada no conteúdo do curso e estou bastante animado! O projeto final parece ser bem desafiador, mas com certeza vai ser muito gratificante. Quero saber de vocês: alguém já tem alguma ideia para o aplicativo de Lista de Tarefas? Eu estou pensando em fazer algo simples, mas com uma interface bonita e fácil de usar. O que vocês acham?",
      "horario": "2025-06-05T14:24:00.971Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí pessoal, tudo bem? Estou dando uma olhada no conteúdo do curso e me deparei com a parte de Jetpack Compose. Alguém já começou a explorar a biblioteca? Estou achando interessante a ideia de criar interfaces modernas e personalizadas. O professor Celso vai mostrar pra gente como fazer um aplicativo completo, né? Alguém tem alguma dúvida sobre o que vai ser abordado nas próximas aulas?",
      "horario": "2025-06-05T14:25:01.467Z"
    },
    {
      "nomeGrupo": "Escola de Programadores Mobile",
      "mensagem": "E aí pessoal, tudo bem? Estou dando uma olhada no conteúdo do curso e me deparei com o projeto final que vamos desenvolver. Um aplicativo de lista de tarefas com Jetpack Compose e Room parece ser um desafio interessante! Alguém já começou a pensar em como vai estruturar o seu aplicativo? Querem discutir um pouco sobre como vamos começar?",
      "horario": "2025-06-05T14:26:01.365Z"
    },
    {
      "nomeGrupo": "Teste Bot",
      "mensagem": "E aí, turma! Tudo certo com os estudos em \"Teste Bot\"? Qualquer dúvida, mandem aqui!",
      "horario": "2025-06-06T13:59:31.112Z"
    },
    {
      "nomeGrupo": "Teste Bot",
      "mensagem": "Olá! Hoje é um bom momento para revisar os conteúdos do curso \"Teste Bot\". Em breve enviaremos novidades!",
      "horario": "2025-06-06T14:00:31.360Z"
    },
    {
      "nomeGrupo": "Teste Bot",
      "mensagem": "E aí pessoal, tudo bem? Acabei de dar uma olhada no conteúdo do curso e estou bastante animado! O projeto final parece ser bem desafiador, mas com a trilha de aprendizado que o professor Celso Brunno preparou, acho que vamos conseguir fazer um aplicativo de lista de tarefas bem completo. Alguém já começou a se familiarizar com o IntelliJ IDEA e o Android Studio? Estou com um pouco de dificuldade em configurar o ambiente de desenvolvimento...",
      "horario": "2025-06-06T14:15:33.389Z"
    }
  ],
  "120363400018454393@g.us": [
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "Galera, tudo bem? Acabei de dar uma olhada no material da Escola de Programadores e estou bastante animado com o que vai ser abordado! O nível 3 parece ser bem desafiador, principalmente com a criação de APIs com Flask/Django e integração com banco de dados. Alguém já está se preparando para o próximo nível ou ainda está decidindo qual nível começar?",
      "horario": "2025-06-03T14:27:18.338Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "E aí, pessoal! Tudo bem? Estou aqui revisando o material da Escola de Programadores e me deparei com a parte dos Círculos de Estudos. Alguém já conhecia essa iniciativa? Eu estou pensando em participar do Círculo de Estudos de Python, alguém tem alguma experiência ou dica?",
      "horario": "2025-06-03T17:30:18.396Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "E aí, pessoal! Queria compartilhar uma coisa que achei interessante sobre o curso. Vocês sabem que vamos começar a Escola de Programadores em breve e eu estava lendo sobre os níveis de aprendizado. Achei muito legal que no nível 3 vamos criar uma API funcional com Flask/Django e banco de dados PostgreSQL. Alguém já tem experiência com isso? Quais são as expectativas de vocês para o curso?",
      "horario": "2025-06-04T13:30:17.767Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "Galera! Quero compartilhar uma coisa que achei muito interessante no material do curso. Vocês sabem que a Escola de Programadores é uma jornada de 8 semanas, mas o que eu não sabia é que a gente vai ter um projeto final em cada nível! No nível 1, o objetivo é criar um portfólio web pessoal, no nível 2 um jogo interativo com Python e no nível 3 uma API funcional com Flask ou Django. E tem mais, nos Círculos de Estudos a gente pode aprofundar conhecimentos específicos e trocar experiências. Alguém já começou a se preparar para a jornada?",
      "horario": "2025-06-04T14:00:18.141Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "Olá! Hoje é um bom momento para revisar os conteúdos do curso \"Escola de Programadores\". Em breve enviaremos novidades!",
      "horario": "2025-06-04T17:52:16.249Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "E aí, pessoal! Tudo bem? Estou aqui revisando o material da Escola de Programadores e me deparei com a parte dos Círculos de Estudos. Alguém aqui já participou ou está pensando em participar de algum? O Círculo de Estudos de Python parece muito interessante, alguém tem alguma experiência com Python que possa compartilhar?",
      "horario": "2025-06-04T18:23:17.318Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "E aí, pessoal! Tudo bem? Estou aqui revisando o material da Escola de Programadores e me deparei com a parte dos Círculos de Estudos. Alguém já conhecia essa iniciativa? Eu acho que é uma ótima oportunidade para aprofundar conhecimentos específicos e trocar experiências com os colegas. O Círculo de Estudos de Python parece interessante, alguém tem interesse em participar?",
      "horario": "2025-06-04T18:24:17.546Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "E aí, pessoal! Tudo bem? Estou aqui revisando o material da Escola de Programadores e me deparei com a parte dos Círculos de Estudos. Alguém já conhecia? Parece ser uma ótima oportunidade para aprofundar conhecimentos e trocar experiências com os colegas das graduações em ADS e Gestão de TI. O Círculo de Estudos de Python parece especialmente interessante para mim, e vocês? Algum de vocês pretende se inscrever?",
      "horario": "2025-06-04T20:00:17.906Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "E aí, pessoal! Tudo bem? Estou aqui revisando o material da Escola de Programadores e me deparei com uma parte que achei muito interessante. Vocês sabem que ao longo das 8 semanas, a gente vai trabalhar em projetos práticos, certo? No nível 1, o objetivo é criar um portfólio web pessoal, enquanto no nível 2, vamos desenvolver um jogo interativo com Python e PyGame. E para quem se interessa por aplicativos mobile, tem o nível 3 com Kotlin e Jetpack Compose.\n\nGostaria de saber, quem aqui já tem uma ideia do que gostaria de desenvolver no projeto do nível 1? Estou começando a pensar no meu e qualquer troca de ideias pode ser valiosa!",
      "horario": "2025-06-05T13:27:19.032Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "E aí, pessoal! Tudo bem? Estou aqui revisando o material da Escola de Programadores e fiquei curioso, quem aqui já tem uma ideia do que vai desenvolver no projeto final do Nível 1? Estou começando a pensar no meu portfólio web pessoal e gostaria de trocar ideias com vocês. Se alguém tiver alguma dica ou sugestão, compartilhe!",
      "horario": "2025-06-05T14:24:03.243Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "E aí, pessoal! Como estão indo os estudos? Acabei de dar uma olhada no material da Escola de Programadores e estou bastante animado com os projetos que vamos desenvolver. No meu caso, estou mais curioso sobre o Círculo de Estudos de Python, alguém já tem experiência com a linguagem? Querem que a gente marque um encontro para trocar ideias e começar a se preparar para as aulas?",
      "horario": "2025-06-05T14:25:01.869Z"
    },
    {
      "nomeGrupo": "Escola de Programadores",
      "mensagem": "E aí, pessoal! Tudo bem? Estou aqui revisando o material da Escola de Programadores e me deparei com uma parte que achei bem interessante. Vocês sabem que ao longo das 8 semanas, vamos desenvolver projetos práticos, certo? No nível 1, o foco é criar um portfólio web pessoal, enquanto no nível 2, vamos desenvolver um jogo interativo com Python e PyGame. Alguém já começou a se preparar ou pensando em como vai abordar esses projetos?",
      "horario": "2025-06-05T14:26:03.032Z"
    },
    {
      "nomeGrupo": "Teste",
      "mensagem": "Só para dar um alô e desejar foco total nos estudos do curso \"Teste\"!",
      "horario": "2025-06-06T13:55:11.242Z"
    },
    {
      "nomeGrupo": "Teste",
      "mensagem": "Pessoal, passando para lembrar de dar uma olhada no material do curso \"Teste\". Bons estudos!",
      "horario": "2025-06-06T13:59:15.854Z"
    },
    {
      "nomeGrupo": "Teste",
      "mensagem": "Uma ótima semana de estudos para todos do curso \"Teste\"! Vamos com tudo! ✨",
      "horario": "2025-06-06T14:00:16.093Z"
    },
    {
      "nomeGrupo": "Teste",
      "mensagem": "E aí, pessoal! Queria compartilhar uma coisa que me chamou a atenção no material do curso. Vocês sabem que a gente vai ter um projeto final em cada nível, né? E o que achei legal é que no nível 3 a gente vai criar uma API funcional com Flask ou Django e banco de dados PostgreSQL. Alguém já tem ideia de como vai ser o projeto de vocês? Eu estou começando a pensar no meu... E aí, o que vocês acham? Querem trocar ideias?",
      "horario": "2025-06-06T14:15:17.160Z"
    },
    {
      "nomeGrupo": "Teste",
      "mensagem": "E aí, pessoal! Queria compartilhar uma coisa que me chamou a atenção no material do curso. Vocês sabem que a gente vai ter um projeto final em cada nível, né? E o que eu achei legal é que no nível 3 a gente vai criar uma API funcional com Flask ou Django e PostgreSQL. Alguém já tem ideia de como vai ser isso? Eu estou um pouco perdido ainda... Se alguém tiver alguma dica ou explicação, pode compartilhar?",
      "horario": "2025-06-06T19:00:17.913Z"
    },
    {
      "nomeGrupo": "Teste",
      "mensagem": "E aí, pessoal! Queria compartilhar uma coisa que achei interessante sobre o curso. Vocês sabem que vamos ter um projeto final em cada nível, né? No nível 1, vamos criar um portfólio web pessoal, que deve ser bem útil para mostrar nossos trabalhos. Alguém já começou a pensar no que vai criar? Eu estou começando a esboçar algumas ideias...",
      "horario": "2025-06-06T19:30:17.668Z"
    },
    {
      "nomeGrupo": "Teste",
      "mensagem": "E aí, pessoal! Tudo bem? Estou dando uma olhada no material do curso e achei bem interessante essa parte sobre os Círculos de Estudos. Alguém já conhecia? Parece uma boa oportunidade para se aprofundar em tópicos específicos e trocar experiências com os colegas. O que vocês acham? Devemos participar?",
      "horario": "2025-06-06T20:00:17.669Z"
    },
    {
      "nomeGrupo": "Teste",
      "mensagem": "E aí pessoal, tudo bem? Acabei de dar uma olhada no material do curso e estou bastante animado com o que vamos aprender! Vocês repararam que ao longo das 8 semanas vamos estar desenvolvendo projetos práticos em cada nível? No nível 1, por exemplo, o objetivo é criar um portfólio web pessoal, enquanto no nível 3 vamos construir uma API funcional com Flask/Django. Alguém já começou a se preparar ou tem alguma expectativa para o que vamos aprender?",
      "horario": "2025-06-06T20:30:17.357Z"
    },
    {
      "nomeGrupo": "Teste",
      "mensagem": "E aí, pessoal! Tudo bem? Estou aqui revisando o material do curso e me deparei com a parte dos Círculos de Estudos. Alguém já conhecia? Parece que são encontros extras para aprofundar conhecimentos específicos e trocar experiências. Eu acho que seria uma ótima oportunidade para aprender mais e se conectar com os colegas. Alguém tem planos de se inscrever?",
      "horario": "2025-06-11T12:48:00.061Z"
    }
  ],
  "120363399566451735@g.us": [
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estou super animado com o nosso 1º Encontro Nacional de Docência! Queria compartilhar com vocês que já comecei a me preparar para as apresentações e estou ansioso para ver o que cada um de vocês vai trazer. Alguém já tem alguma ideia do que vai falar? Eu estou pensando em compartilhar algumas experiências que tive em sala de aula e que acho que podem ser úteis para todos. O que vocês acham? Vamos trocar uma ideia e começar a semana com energia!",
      "horario": "2025-06-04T14:00:34.151Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "Olá! Hoje é um bom momento para revisar os conteúdos do curso \"1º Encontro Nacional de Docência\". Em breve enviaremos novidades!",
      "horario": "2025-06-04T17:52:31.488Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "\"E aí, pessoal! Estou muito animado com o nosso 1º Encontro Nacional de Docência! Acabei de saber que teremos uma palestra incrível sobre metodologias ativas e vou compartilhar algumas dicas com vocês. Alguém já está ansioso para o encontro? O que vocês acham que vai ser o destaque do evento? Estou ansioso para ver todos vocês e trocar experiências!\"",
      "horario": "2025-06-04T18:23:33.127Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estou muito animado com o nosso 1º Encontro Nacional de Docência. Como estão se preparando? Eu estou ansioso para conhecer todos e trocar experiências. Alguém já tem alguma ideia do que vai apresentar? Eu estou pensando em compartilhar algumas práticas que dei certo na minha última aula. E vocês, o que acham de começarmos a compartilhar algumas ideias?",
      "horario": "2025-06-04T18:24:33.576Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estou muito animado com o nosso 1º Encontro Nacional de Docência! Alguém já começou a se preparar para as apresentações? Eu estou começando a organizar as minhas ideias e já estou ansioso para compartilhar com vocês. A propósito, alguém sabe se teremos algum tipo de certificado ou reconhecimento para os participantes? Quero saber se vale a pena também para o meu currículo. Como estão indo os preparativos de vocês?",
      "horario": "2025-06-04T20:00:33.690Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "Olá pessoal! Estão preparados para o 1º Encontro Nacional de Docência? Eu estou ficando animado com a programação. A palestra de amanhã com a Dra. Sarah Carime Braga Santana sobre \"Educação para a Diversidade\" parece muito interessante. Como podemos trabalhar a diversidade cultural e étnico-racial em nossas salas de aula? Alguém tem alguma experiência ou ideia para compartilhar?",
      "horario": "2025-06-05T14:25:04.789Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "Galera, tudo bem? Queria só relembrar que o nosso 1º Encontro Nacional de Docência está chegando! Já estão ansiosos para as palestras? Eu estou muito curioso para ouvir a Dra. Sarah Carime Braga Santana falar sobre \"Educação para a Diversidade: Práticas, Saberes e Compromisso\" hoje às 19h30. Achei muito interessante a ementa dela, falando sobre as múltiplas dimensões da educação para a diversidade. E vocês, o que estão mais ansiosos para aprender?",
      "horario": "2025-06-05T14:26:03.710Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estão preparados para o 1º Encontro Nacional de Docência? Eu estou ficando cada vez mais animado! Acabei de ver o cronograma e quero compartilhar com vocês. A palestra da Dra. Sarah Carime Braga Santana sobre Educação para a Diversidade no dia 24 já está me fazendo refletir sobre como podemos incluir mais diversidade nas nossas práticas de ensino. E vocês, o que estão achando do tema? Quais são as expectativas de vocês para o encontro?",
      "horario": "2025-06-05T14:27:04.159Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, turma! Tudo certo com os estudos em \"1º Encontro Nacional de Docência\"? Qualquer dúvida, mandem aqui!",
      "horario": "2025-06-06T13:55:00.892Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "Pessoal, passando para lembrar de dar uma olhada no material do curso \"1º Encontro Nacional de Docência\". Bons estudos!",
      "horario": "2025-06-06T13:59:00.536Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "Só para dar um alô e desejar foco total nos estudos do curso \"1º Encontro Nacional de Docência\"!",
      "horario": "2025-06-06T14:00:00.794Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estou dando uma olhada no material do curso e me deparei com as palestras que vão acontecer nos próximos dias. Achei muito interessante a palestra da Dra. Sarah Carime Braga Santana sobre \"Educação para a Diversidade: Práticas, Saberes e Compromisso\". É um tema tão importante e atual, não é mesmo?\n\nAlguém já pensou em como podemos aplicar esses conceitos em nossas práticas docentes? Eu estou começando a refletir sobre como posso trabalhar a diversidade em minha sala de aula. Quais são as experiências de vocês?",
      "horario": "2025-06-06T14:12:01.807Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estão preparados para o 1º Encontro Nacional de Docência? Eu estou ficando cada vez mais animado! Acabei de dar uma olhada no material e achei muito interessante a palestra da Dra. Sarah Carime Braga Santana sobre Educação para a Diversidade. É um tema tão importante e atual, não é mesmo? Gostaria de saber o que vocês acham sobre a abordagem da diversidade nas escolas. Alguém tem alguma experiência ou reflexão para compartilhar?",
      "horario": "2025-06-06T14:15:00.987Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estão preparados para o 1º Encontro Nacional de Docência? Eu estou ficando cada vez mais animado! Acabei de dar uma olhada no material e achei super interessante a palestra da Dra. Sarah Carime Braga Santana sobre \"Educação para a Diversidade\". É um tema tão importante e atual, não é mesmo? Gostaria de saber o que vocês acham sobre a abordagem da diversidade nas escolas. Alguém tem alguma experiência ou ideia para compartilhar?",
      "horario": "2025-06-06T19:00:01.755Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estou dando uma olhada no material do nosso curso e me chamou a atenção a palestra da Dra. Layane Rodrigues de Lima sobre o ensino da língua portuguesa como L2 na educação básica. Achei muito interessante a ideia de valorizar as línguas e culturas como ponto de partida para o ensino. Alguém já teve alguma experiência com ensino de línguas para alunos que não falam português como primeira língua? Querem compartilhar? \n\nE não esqueçam que a programação é intensa esses dias, vamos nos preparando para os encontros!",
      "horario": "2025-06-06T19:30:01.327Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Queria compartilhar uma coisa que me chamou a atenção no material do curso. A palestra da Dra. Sarah Carime Braga Santana sobre \"Educação para a Diversidade\" parece muito interessante. Acho que é um tema tão importante e atual, não é mesmo? Gostaria de saber o que vocês acham sobre a relação entre educação e diversidade. Alguém já teve alguma experiência nesse sentido? \n\nE só um lembrete: o primeiro encontro já é dia 24! Estamos quase lá.",
      "horario": "2025-06-06T20:00:01.750Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estou dando uma olhada no conteúdo do nosso curso e me chamou a atenção a palestra da Dra. Sarah Carime Braga Santana sobre \"Educação para a Diversidade\". É tão importante refletir sobre as múltiplas dimensões que englobam esse tema, não é mesmo? Quero saber de vocês, o que estão achando do conteúdo até agora? Estão conseguindo relacionar com a prática de vocês?",
      "horario": "2025-06-06T20:30:01.424Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estão preparados para o nosso 1º Encontro Nacional de Docência? Olhei o cronograma e estou muito animado com as palestras! A Dra. Sarah Carime Braga Santana vai falar sobre Educação para a Diversidade, um tema tão importante hoje em dia. E você, o que achou do conteúdo até agora? Alguma palestra ou tema que te chamou mais a atenção? Lembre-se de que o encontro começa dia 24, às 19h30! Não percam!",
      "horario": "2025-06-09T16:19:01.754Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estão se preparando para o 1º Encontro Nacional de Docência? Eu estou ficando cada vez mais animado com a programação! A palestra da Dra. Sarah Carime Braga Santana sobre \"Educação para a Diversidade\" me chamou特别 atenção. É tão importante discutir sobre inclusão e diversidade na educação, não é mesmo? \n\nAlguém já tinha conhecimento sobre algum dos palestrantes ou temas que serão abordados? Eu estou ansioso para conhecer mais sobre esses assuntos e trocar ideias com vocês! \n\nLembrando que o primeiro dia é dia 24, às 19h30. Não percam!",
      "horario": "2025-06-09T16:42:01.624Z"
    },
    {
      "nomeGrupo": "1º Encontro Nacional de Docência",
      "mensagem": "E aí, pessoal! Estou dando uma olhada no material do curso e me deparei com as palestras que vão acontecer nos próximos dias. Achei muito interessante a palestra da Dra. Sarah Carime Braga Santana sobre \"Educação para a Diversidade: Práticas, Saberes e Compromisso\". É um tema tão relevante hoje em dia, não é mesmo? Gostaria de saber o que vocês acham sobre a importância de abordar a diversidade nas escolas. Alguém tem alguma experiência ou insight para compartilhar? \n\nE só um lembrete: não esqueçam de confirmar presença para as palestras. \n\nUm abraço!",
      "horario": "2025-06-11T11:12:01.021Z"
    }
  ],
  "120363340455449300@g.us": [
    {
      "nomeGrupo": "Sala Web da Loculagem 🤯",
      "mensagem": "Olá! Hoje é um bom momento para revisar os conteúdos do curso \"Sala Web da Loculagem 🤯\". Em breve enviaremos novidades!",
      "horario": "2025-06-05T20:52:48.717Z"
    }
  ]
}